ams/src/DataProcessors/AMS_ДоступностьТоваров/AMS_ДоступностьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AMS_ДоступностьТоваров</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьОтрицательныеОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьОстаткиЦех3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цех</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>План2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВНаличии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Резерв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доступно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расход</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаказыКлиента</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказКлиента</name>
      <type>
        <types>DocumentRef.ЗаказКлиента</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ams/src/AccumulationRegisters/ТоварыКОтгрузке/ТоварыКОтгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыКОтгрузке</name>
  <resources>
    <name>ВРезерве</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОтгрузке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОформлению</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КСборке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собирается</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Собрано</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.ЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>DefinedType.ОтправительПолучательТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DefinedType.РаспоряжениеНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КонтролируемаяПартия</name>
    <type>
      <types>CatalogRef.КонтролируемыеПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ams/src/Enums/_ПроизводственныеСмены/_ПроизводственныеСмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>_ПроизводственныеСмены</name>
  <enumValues>
    <name>Дневная</name>
  </enumValues>
  <enumValues>
    <name>Вечерняя</name>
  </enumValues>
</mdclass:Enum>

ams/src/DataProcessors/AMS_ДоступностьТоваров/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьТаблицуЗаказыКлиента() Экспорт
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Метки", ЗаказыКлиента.Выгрузить(Новый Структура("Метка", Истина), "Метка, ЗаказКлиента"));
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Метки.ЗаказКлиента КАК ЗаказКлиента,
		|	Метки.Метка КАК Метка
		|ПОМЕСТИТЬ Метки
		|ИЗ
		|	&Метки КАК Метки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	д.ДатаОтгрузки КАК ДатаОтгрузки,
		|	д.Ссылка КАК ЗаказКлиента
		|ПОМЕСТИТЬ Заказы
		|ИЗ
		|	Документ.ЗаказКлиента.Товары КАК т
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК д
		|		ПО т.Ссылка = д.Ссылка
		|ГДЕ
		|	д.ДатаОтгрузки > &ТекущаяДата
		|	И д.Проведен
		|	И т.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Метки.Метка КАК Метка,
		|	Заказы.ДатаОтгрузки КАК ДатаОтгрузки,
		|	Заказы.ЗаказКлиента КАК ЗаказКлиента
		|ИЗ
		|	Заказы КАК Заказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Метки КАК Метки
		|		ПО Заказы.ЗаказКлиента = Метки.ЗаказКлиента
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаОтгрузки,
		|	Заказы.ЗаказКлиента.Номер";
	
	ЗаказыКлиента.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Процедура ЗаполнитьТаблицуТовары() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказыКлиента", ЗаказыКлиента.Выгрузить(Новый Структура("Метка", Истина), "ЗаказКлиента"));
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СкладПродукции", AMS_ВызовСервера.СкладПродукции());
	Запрос.УстановитьПараметр("Цех3", "Цех 3");
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	ВЫРАЗИТЬ(т.Номенклатура.ВидНоменклатуры.Описание КАК СТРОКА(5)) КАК Цех,
	|	СУММА(т.КоличествоУпаковок) КАК Расход,
	|	т.Номенклатура.Наименование КАК НоменклатураНаименование
	|ПОМЕСТИТЬ Ном
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Ссылка В(&ЗаказыКлиента)
	|	И т.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|	И т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура,
	|	ВЫРАЗИТЬ(т.Номенклатура.ВидНоменклатуры.Описание КАК СТРОКА(5))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	т.КоличествоУпаковок КАК КоличествоУпаковок
	|ПОМЕСТИТЬ ТекДок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК т
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	д.Ссылка = &ЗаказКлиента
	|	И т.ВариантОбеспечения = ЗНАЧЕНИЕ(Перечисление.ВариантыОбеспечения.КОбеспечению)
	|	И т.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоПлан) КАК План1,
	|	СУММА(т.КоличествоФакт) КАК Факт1
	|ПОМЕСТИТЬ День
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|	И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Дневная)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	СУММА(т.КоличествоПлан) КАК План2,
	|	СУММА(т.КоличествоФакт) КАК Факт2
	|ПОМЕСТИТЬ Вечер
	|ИЗ
	|	Документ.AMS_ПроизводствоЗаСмену КАК д
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ПроизводствоЗаСмену.Продукция КАК т
	|		ПО д.Ссылка = т.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|	И д.Смена = ЗНАЧЕНИЕ(Перечисление._ПроизводственныеСмены.Вечерняя)
	|
	|СГРУППИРОВАТЬ ПО
	|	т.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	т.ВНаличииОстаток / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК ВНаличии
	|ПОМЕСТИТЬ НаСкладе
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(
	|			,
	|			Склад = &СкладПродукции
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						Ном КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Номенклатура КАК Номенклатура,
	|	(т.ВРезервеОстаток + т.КОтгрузкеОстаток) / т.Номенклатура.КоэффициентЕдиницыДляОтчетов КАК Резерв
	|ПОМЕСТИТЬ КОтгрузке
	|ИЗ
	|	РегистрНакопления.ТоварыКОтгрузке.Остатки(
	|			,
	|			Склад = &СкладПродукции
	|				И Номенклатура В
	|					(ВЫБРАТЬ
	|						т.Номенклатура КАК Номенклатура
	|					ИЗ
	|						Ном КАК т)) КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Ном.Номенклатура КАК Номенклатура,
	|	Ном.Цех КАК Цех,
	|	День.План1 КАК План1,
	|	День.Факт1 КАК Факт1,
	|	Вечер.План2 КАК План2,
	|	Вечер.Факт2 КАК Факт2,
	|	НаСкладе.ВНаличии КАК ВНаличии,
	|	КОтгрузке.Резерв КАК Резерв,
	|	ЕСТЬNULL(НаСкладе.ВНаличии, 0) - ЕСТЬNULL(КОтгрузке.Резерв, 0) КАК Доступно,
	|	Ном.Расход КАК Расход,
	|	ЕСТЬNULL(НаСкладе.ВНаличии, 0) - ЕСТЬNULL(КОтгрузке.Резерв, 0) - ЕСТЬNULL(Ном.Расход, 0) КАК Остаток,
	|	ТекДок.КоличествоУпаковок КАК КоличествоУпаковок,
	|	Ном.НоменклатураНаименование КАК НоменклатураНаименование
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	Ном КАК Ном
	|		ЛЕВОЕ СОЕДИНЕНИЕ День КАК День
	|		ПО Ном.Номенклатура = День.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Вечер КАК Вечер
	|		ПО Ном.Номенклатура = Вечер.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекДок КАК ТекДок
	|		ПО Ном.Номенклатура = ТекДок.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ НаСкладе КАК НаСкладе
	|		ПО Ном.Номенклатура = НаСкладе.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ КОтгрузке КАК КОтгрузке
	|		ПО Ном.Номенклатура = КОтгрузке.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт.Номенклатура КАК Номенклатура,
	|	вт.Цех КАК Цех,
	|	вт.План1 КАК План1,
	|	вт.Факт1 КАК Факт1,
	|	вт.План2 КАК План2,
	|	вт.Факт2 КАК Факт2,
	|	вт.ВНаличии КАК ВНаличии,
	|	вт.Резерв КАК Резерв,
	|	вт.Доступно КАК Доступно,
	|	вт.Расход КАК Расход,
	|	вт.Остаток КАК Остаток,
	|	вт.КоличествоУпаковок КАК КоличествоУпаковок,
	|	вт.НоменклатураНаименование КАК НоменклатураНаименование
	|ИЗ
	|	вт КАК вт";
	
	Если ПоказатьОтрицательныеОстатки Тогда
		Запрос.Текст = Запрос.Текст + "
	|ГДЕ
	|	вт.Остаток < 0";
	КонецЕсли;
	
	Если ПоказатьОстаткиЦех3 Тогда
		Запрос.Текст = Запрос.Текст + "
	|	И вт.Цех = &Цех3";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	НоменклатураНаименование";
	
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

Процедура ПоказатьКоличествоУпаковокНоменклатурыВЗаказах() Экспорт
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЗаказыКлиента", ЗаказыКлиента.Выгрузить());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	т.Метка КАК Метка,
	|	т.ДатаОтгрузки КАК ДатаОтгрузки,
	|	т.ЗаказКлиента КАК ЗаказКлиента
	|ПОМЕСТИТЬ Заказы
	|ИЗ
	|	&ЗаказыКлиента КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заказы.Метка КАК Метка,
	|	Заказы.ДатаОтгрузки КАК ДатаОтгрузки,
	|	Заказы.ЗаказКлиента КАК ЗаказКлиента,
	|	ЗаказыТовары.КоличествоУпаковок КАК КоличествоУпаковок
	|ИЗ
	|	Заказы КАК Заказы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказыТовары
	|		ПО Заказы.ЗаказКлиента = ЗаказыТовары.Ссылка
	|			И (ЗаказыТовары.Номенклатура = &Номенклатура)";
	
	ЗаказыКлиента.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти

#КонецЕсли
